app/Libraries/Auth.php

  public function authenticate(): ?object
  {
    $user_model = new $this->user_model();
    $user = $user_model->where('session_id', session_id())->first();
---
SELECT *
FROM `user`
WHERE `session_id` = 'sdbq7b92daehqqg7htbblf2j7cuqqgev'
 LIMIT 1

  public function logout(): void
  {
    $user_model = new $this->user_model();
    $user = $user_model->where('session_id', session_id())->first();
    $user->session_id = null;
    $user_model->save($user);
---
SELECT *
FROM `user`
WHERE `session_id` = 'eood5ogfk4078fq5nsrm31ejk0favhr3'
 LIMIT 1
UPDATE `user` SET `session_id` = NULL
WHERE `user`.`id` IN ('7')

  public function login(array $data): ?object
  {
    $user_model = new $this->user_model();
    $username = $data['username'];
    $password = $data['password'];
    if ($user_model->user_exists($username)) {
      $user = $user_model->where('username', $username)->first() ?? $user_model->where('email', $username)->first();
      if (!password_verify($password, $user->password)) return null;
      $user->session_id = session_id();
      $user_model->save($user);
---
SELECT *
FROM `user`
WHERE `username` = 'salvio@gmail.com'
 LIMIT 1
UPDATE `user` SET `session_id` = 'eood5ogfk4078fq5nsrm31ejk0favhr3'
WHERE `user`.`id` IN ('7')